/* Main alert text */
"Q_HEADLINE_APP" = "“%@” is %@ %@. Are you sure you want to open it?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below). Example: “[GigaFun]” is [an application] [attached to a mail message]. Are you sure you want to open it? */
"Q_HEADLINE_APP_THAT_WAS" = "“%@” is %@ that was %@. Are you sure you want to open it?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below). Example: “[GigaFun]” is [an application] that was [attached to a mail message]. Are you sure you want to open it? */
"Q_HEADLINE_DOC_BINDING" = "“%@” may be %@. It was %@ and will be opened by %@. Are you sure you want to open it?"; /* file name, application type (see Q_TYPE_*, below), origin phrase (see Q_ORIGIN_*, below), app name. Example: “[Fun.html]” may be [an application]. It was [attached to a mail message] and will be opened by [GigaFun]. Are you sure you want to open it?*/
"Q_HEADLINE_MALWARE" = "“%@” will damage your computer. You should move it to the Trash."; /* file name. Example:  “[GigaFun]” will damage your computer. You should move it to the Trash. */

/* Origin phrases for the headline */
/* These phrases complete the sentence "This file was..." */
"Q_ORIGIN_INTERNET" = "downloaded from the Internet"; 
"Q_ORIGIN_WEB" = "downloaded from the Internet";
"Q_ORIGIN_MAIL" = "attached to a mail message";
"Q_ORIGIN_CHAT" = "attached to a chat message";
"Q_ORIGIN_CALENDAR" = "attached to a calendar event";
"Q_ORIGIN_MESSAGE" = "attached to a message";

/* Detail text for malware */
"Q_DETAIL_MALWARE_NAME" = "It contains the “%@” malware."; /* malware signature name */
"Q_HEADLINE_MALWARE_MOVE_ERROR" = "“%@” could not be moved to Trash."; /* name */
"Q_HEADLINE_MALWARE_EJECT_ERROR" = "The disk image containing “%@” could not be ejected."; /* name */
"Q_DETAIL_MALWARE_REMOVE_ERROR" = "This malware must be removed manually.";

/* Detail text for files */
"Q_DETAIL_DOWNLOAD_DATE" = "This %@ was downloaded %@."; /* "file" or "alias", date phrase */
"Q_DETAIL_DOWNLOAD_AGENT_DATE" = "%@ downloaded this %@ %@."; /* application name, "file" or "alias", date phrase */
"Q_DETAIL_DOWNLOAD_AGENT_DATE_FROM" = "%@ downloaded this %@ %@ from %@."; /* application name, "file" or "alias", date phrase, Internet domain name */
"Q_DETAIL_RECEIVED_AGENT_DATE" = "%@ received this %@ %@."; /* application name, "file" or "alias", date phrase */
"Q_DETAIL_TYPE_FILE" = "file";
"Q_DETAIL_TYPE_ALIAS" = "alias";

/* Detail text for disk images */
"Q_DETAIL_ON_DMG" = "“%@” is on the disk image “%@”."; /* filename, filename */
"Q_DETAIL_ON_DMG_UNKNOWN" = "“%@” is on a disk image that can't be found."; /* filename */
"Q_DETAIL_DMG_DOWNLOAD_DATE" = "This disk image was downloaded %@."; /* date phrase */
"Q_DETAIL_DMG_DOWNLOAD_AGENT_DATE" = "%@ downloaded this disk image %@."; /* application name, date phrase */
"Q_DETAIL_DMG_DOWNLOAD_AGENT_DATE_FROM" = "%@ downloaded this disk image %@ from %@."; /* application name, date phrase, Internet domain name */
"Q_DETAIL_DMG_RECEIVED_AGENT_DATE" = "%@ received this disk image %@."; /* application name, date phrase */

/* Detail text for network file systems */
"Q_DETAIL_ON_SERVER" = "“%@” is on a network volume."; /* filename */
"Q_DETAIL_ON_SERVER_NAME" = "“%@” is on the network volume “%@”."; /* filename, volume name */
"Q_DETAIL_SERVER_AGENT_DATE" = "%@ opened this network connection %@."; /* application name, date phrase */

/* Date/time phrases used in detail text */
"Q_DATE_TODAY" = "today at %@"; /* time */
"Q_DATE_YESTERDAY" = "yesterday at %@"; /* time */
"Q_DATE_THIS_YEAR" = "on %@"; /* date */
"Q_DATE_FULL" = "on %@"; /* date */
"Q_DATE_UNKNOWN" = "on an unknown date"; /* inserted into the date/time phrase slot when a date is not known (very rare) */

/* Checkbox titles */
"Q_DO_NOT_WARN" = "Don’t warn me when opening this application"; /* (unused) */
"Q_DO_NOT_WARN_DMG" = "Don’t warn me when opening applications on this disk image";
"Q_DO_NOT_WARN_SERVER" = "Don’t warn me when opening applications on this network volume";

/* Regular button titles */
"Q_BUTTON_OPEN" = "Open";
"Q_BUTTON_CANCEL" = "Cancel";
"Q_BUTTON_SHOW_WEB_PAGE" = "Show Web Page";
"Q_BUTTON_SHOW_MAIL" = "Show Message";
"Q_BUTTON_SHOW_CHAT" = "Show Message";
"Q_BUTTON_SHOW_CALENDAR" = "Show Event";
"Q_BUTTON_SHOW_DMG" = "Show Disk Image";
"Q_BUTTON_SHOW_APP" = "Show Application";
"Q_BUTTON_SHOW_SOURCE" = "Show Source";
"Q_BUTTON_EJECT_DMG" = "Eject Disk Image";

/* Malware button titles */
"Q_BUTTON_MOVE_TO_TRASH" = "Move to Trash";

/* File kinds */
"Q_TYPE_APPLICATION" = "an application";
"Q_TYPE_SCRIPT_APPLICATION" = "a script application";
"Q_TYPE_UNIX_APPLICATION" = "a Unix application";
"Q_TYPE_JAVA_APPLICATION" = "a Java application";
"Q_TYPE_WEB_APPLICATION" = "a web application";
"Q_TYPE_QUARTZ_APPLICATION" = "a Quartz Composer application";
"Q_TYPE_WINDOWS_APPLICATION" = "a Windows application";
"Q_TYPE_ALIAS_VARIANT" = "%@ alias"; /* application type, e.g. "a Unix application alias" */

/* Help */
"Q_HELP_ANCHOR" = "mh11389";
"Q_HELP_MALWARE_ANCHOR" = "mh27449";
